---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewScaleCustomname
source: html/2213d1ca-8538-0888-2bc5-66eec733a5b6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewScaleCustomname Property

"Display Name"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewScaleCustomname { get; }
```